# 05  Паспорт Quest Tracker
# • Создайте quest_db.json с ключами next_id и players.
# • Добавьте двух игроков. У каждого должны быть id, nickname, level, inventory и quests.
# • Проверьте файл через json.load и выведите количество игроков.



# 06  Надёжное хранилище
# • Напишите load_db и save_db.
# • При отсутствии файла или повреждённом JSON возвращайте пустую структуру базы.
# • Сохраняйте кириллицу без кодов Unicode и используйте отступ 4.



# 07  Регистрация игрока
# • Напишите add_player(data, nickname).
# • Используйте next_id, стартовый level 1 и пустые списки.
# • После добавления увеличьте next_id и верните созданного игрока.



# 08  Находка в инвентаре
# • Напишите add_item(data, player_id, item).
# • Найдите игрока по id, не добавляйте одинаковый предмет дважды.
# • Верните True при добавлении и False, если игрок или предмет не подходят.



# 09  Журнал квестов
# • Добавьте игроку квест с полями title и done.
# • Напишите complete_quest для выполнения квеста по названию.
# • Выведите только незавершённые квесты выбранного игрока.



# 10  Мини-проект Quest Tracker
# • Соберите меню: список игроков, новый игрок, новый предмет, новый квест, завершение квеста, выход.
# • Разделите загрузку и сохранение данных на функции.
# • Каждую крупную возможность создайте в отдельной feature-ветке и затем объедините в main.
